/* 
  Localizable.strings
  i3Trip

  Created by Ronald Mannak on 12/14/15.
  Copyright © 2015 Ronald Mannak. All rights reserved.
*/


/*
 *  Time
 */

"hours"                             = "hours";
"minutes"                           = "minutes";


/* 
 *  VehicleStatus
 */

"INVALID"                           = "Invalid";
"CHARGING"                          = "Charging";
"FINISHED_FULLY_CHARGED"            = "Finished charging. Fully charged";
"FINISHED_NOT_FULL"                 = "Finished charging. Not full";
"WAITING_FOR_CHARGING"              = "Waiting for charging";
"NOT_CHARGING"                      = "Not charging";
"ERROR"                             = "Charging error";

/*
 *  ConnectionStatus
 */

"CHARGING_DONE"                     = "Charging is done";
"CHARGING_INTERRUPED"               = "Charging has been interrupted";
"CHARGING_PAUSED"                   = "Charging is paused";
"CHARGING_STARTED"                  = "Charging started";
"CHARGIN_STARTED"                   = "Charging started";
"CYCLIC_RECHARGING"                 = "Cyclic charging";
"DOOR_STATE_CHANGED"                = "Door state changed";
"NO_CYCLIC_RECHARGING"              = "No cyclic recharging";
"NO_LSC_TRIGGER"                    = "No LSC trigger";
"ON_DEMAND"                         = "On demand";
"PREDICTION_UPDATE"                 = "Prediction Update";
"TEMPORARY_POWER_SUPPLY_FAILURE"    = "Temporary power supply failure";
"UNKNOWN"                           = "Unknown";
"VEHICLE_MOVING"                    = "Vehicle moving";
"VEHICLE_SECURED"                   = "Vehicle secured";
"VEHICLE_SHUTDOWN"                  = "Vehicle shutdown";
"VEHICLE_SHUTDOWN_SECURED"          = "Vehicle secure shutdown";
"VEHICLE_UNSECURED"                 = "Vehicle unsecured";
"DISCONNECTED"                      = "Disconnected";

/*
 *  DoorStatus
 */

"OPEN"                              = "Open";
"CLOSED"                            = "Closed";
"SECURED"                           = "Secured";
"UNLOCKED"                          = "Unlocked";
"INTERMEDIATE"                      = "Intermediate";
"LOCKED"                            = "Locked";
"SELECTIVE_LOCKED"                  = "Selective locked";

/*
 *  LightStatus
 */

"ON"                                = "On";
"OFF"                               = "Off";